app/controllers/favorites_controller.rb

  def create
    @movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-25 12:51:50.484994"], ["movie_id", 1], ["updated_at", "2015-11-25 12:51:50.484994"], ["user_id", 2]]

    def destroy
      favorite = current_user.favorites.find(params[:id])
      favorite.destroy
---
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 2], ["id", 3]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 3]]

  def set_movie
    @movie = Movie.find_by(slug: params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1