app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "This Movie is awesome."], ["created_at", "2015-11-20 11:01:27.600065"], ["movie_id", 1], ["stars", 3], ["updated_at", "2015-11-20 11:01:27.600065"], ["user_id", 1]]