app/controllers/reviews_controller.rb

  def set_movie
    @movie = Movie.find_by(slug: params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'iron-man' LIMIT 1